# Process rankings data from csv files and format into ML readable data

In [1]:
import pandas as pd

In [2]:
bz = pd.read_csv('banzuke_2020.csv')
ht = pd.read_csv('hoshitori_2020.csv')

In [3]:
bz.head()

,rank,name,pob,stable,birthdate,height,weight,year,month
0,Y1e,Hakuho,Mongolia,Miyagino,11.03.1985,193.0,150.7,2020,1
1,Y1w,Kakuryu,Mongolia,Michinoku,10.08.1985,186.0,150.0,2020,1
2,O1e,Takakeisho,Hyogo,Chiganoura,05.08.1996,173.0,149.0,2020,1
3,O1w,Goeido,Osaka,Sakaigawa,06.04.1986,183.0,158.2,2020,1
4,S1e,Asanoyama,Toyama,Takasago,01.03.1994,189.0,158.0,2020,1

In [42]:
bz.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 350 entries, 0 to 349
Data columns (total 9 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   rank       350 non-null    object
 1   name       350 non-null    object
 2   pob        350 non-null    object
 3   stable     350 non-null    object
 4   birthdate  350 non-null    object
 5   height     350 non-null    float64
 6   weight     350 non-null    float64
 7   year       350 non-null    int64
 8   month      350 non-null    int64
dtypes: float64(2), int64(2), object(5)
memory usage: 24.7+ KB

In [4]:
ht.head()

    Result        East Rank      West Result.1  year  month
0   1-3-11      Hakuho    Y   Kakuryu   1-4-10  2020      1
1     11-4  Takakeisho    O    Goeido     5-10  2020      1
2     10-5   Asanoyama    S  Takayasu    6-9 ↓  2020      1
3   5-10 ↓         Abi    K  Daieisho    7-8 ↓  2020      1
4  9-6 S ↑        Endo   M1  Myogiryu     5-10  2020      1

In [19]:
ht.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 478 entries, 0 to 477
Data columns (total 7 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Result    478 non-null    object
 1   East      478 non-null    object
 2   Rank      478 non-null    object
 3   West      472 non-null    object
 4   Result.1  472 non-null    object
 5   year      478 non-null    int64
 6   month     478 non-null    int64
dtypes: int64(2), object(5)
memory usage: 26.3+ KB

# the ideal format for ML processing will have the following structure

Each observation will represent one wrestler, tournament rank, tournament results, next tournament rank
- additional information might be included such as height / weight at beginning of each tournament

## existing problems
- rank is not normalized between bz and ht (uneeded - just need results for x tournament)
- ht is not flattned and has two wrestlers per row
- results are not normalized
- results have strange characters (which are embedded with extra info - but will ignore for now)

## Flatten ht

#### process
- take ht
- slice for east (keep rank, year, month, result)
- slice for west (keep rank, year, month ,result)
- rename columns
- join to bz on name, year, month

In [18]:
west_cols = ['Result', 'West', 'Rank', 'year','month']
east_cols = ['Result.1', 'East', 'Rank', 'year', 'month']
west = ht.loc[:,west_cols]
east = ht.loc[:,east_cols]
east.rename(columns = {'East': 'name', 'Result.1': 'Result'}, inplace = True)
west.rename(columns = {'West': 'name'}, inplace = True)
ht_new = pd.concat([east,west], ignore_index = True)
ht_new.shape

(956, 5)

#### normalize results
- remove speical characters 
- and split win-loss-intai

In [24]:
ht_new.Result.str.split('-', expand = True)

     0    1     2
0    1    4    10
1    5   10  None
2    6  9 ↓  None
3    7  8 ↓  None
4    5   10  None
..  ..  ...   ...
951  3    4  None
952  1    6  None
953  2    5  None
954  5    2  None
955  4    3  None

[956 rows x 3 columns]

In [35]:
ht_new.Result.str.split(expand = True)[[0]]

          0
0    1-4-10
1      5-10
2       6-9
3       7-8
4      5-10
..      ...
951     3-4
952     1-6
953     2-5
954     5-2
955     4-3

[956 rows x 1 columns]

In [41]:
def clean_ht_result(ht):
    """
    clean Result column and return df join back to original df
    """
    
    r_special = ht.Result.str.split(expand = True)[0]
    
    r_new_result = r_special.str.split('-', expand = True)
    r_new_result.rename(columns = {0:'win',1:'loss',2:'absent'}, inplace = True)
    
    return r_new_result

clean_ht_result(ht_new)

    win loss absent
0     1    4     10
1     5   10   None
2     6    9   None
3     7    8   None
4     5   10   None
..   ..  ...    ...
951   3    4   None
952   1    6   None
953   2    5   None
954   5    2   None
955   4    3   None

[956 rows x 3 columns]